import os
import json


OUTPUT_DIR = "./characterNameList"

os.makedirs(OUTPUT_DIR, exist_ok=True)


file_names = [
  "01_中国_文学领域_人物.txt",
"02_中国_影视领域_人物.txt",
"03_中国_音乐领域_人物.txt",
"04_中国_游戏制作领域_人物.txt",
"05_中国_绘画领域_人物.txt",
"06_中国_雕塑领域_人物.txt",
"07_中国_建筑领域_人物.txt",
"08_中国_摄影领域_人物.txt",
"09_中国_动画领域_人物.txt",
"10_中国_戏剧舞台领域_人物.txt",
"11_中国_舞蹈领域_人物.txt",

"12_日本韩国_文学领域_人物.txt",
"13_日本韩国_影视领域_人物.txt",
"14_日本韩国_音乐领域_人物.txt",
"15_日本韩国_游戏制作领域_人物.txt",
"16_日本韩国_绘画领域_人物.txt",
"17_日本韩国_雕塑领域_人物.txt",
"18_日本韩国_建筑领域_人物.txt",
"19_日本韩国_摄影领域_人物.txt",
"20_日本韩国_动画领域_人物.txt",
"21_日本韩国_戏剧舞台领域_人物.txt",
"22_日本韩国_舞蹈领域_人物.txt",

"23_欧美_文学领域_人物.txt",
"24_欧美_影视领域_人物.txt",
"25_欧美_音乐领域_人物.txt",
"26_欧美_游戏制作领域_人物.txt",
"27_欧美_绘画领域_人物.txt",
"28_欧美_雕塑领域_人物.txt",
"29_欧美_建筑领域_人物.txt",
"30_欧美_摄影领域_人物.txt",
"31_欧美_动画领域_人物.txt",
"32_欧美_戏剧舞台领域_人物.txt",
"33_欧美_舞蹈领域_人物.txt",

"34_全球其他_文学领域_人物.txt",
"35_全球其他_影视领域_人物.txt",
"36_全球其他_音乐领域_人物.txt",
"37_全球其他_游戏制作领域_人物.txt",
"38_全球其他_绘画领域_人物.txt",
"39_全球其他_雕塑领域_人物.txt",
"40_全球其他_建筑领域_人物.txt",
"41_全球其他_摄影领域_人物.txt",
"42_全球其他_动画领域_人物.txt",
"43_全球其他_戏剧舞台领域_人物.txt",
"44_全球其他_舞蹈领域_人物.txt"

]


for filename in file_names:

    filepath = os.path.join(
        OUTPUT_DIR,
        filename
    )

    with open(filepath, "w", encoding="utf-8") as f:
        json.dump(
          filename,
            f,
            ensure_ascii=False,
            indent=2
        )

    print("创建:", filename)


print("\n全部创建完成，共", len(file_names), "个文件")